## Module 7-4

#### This notebook contains my work on the fourth video tutorial.

## Reading and Writing CSV and Excel files
   * Read CSV
   * Write CSV
   * Read Excel
   * Write Excel

### Read a CSV into a pandas dataframe

In [1]:
import pandas as pd

df = pd.read_csv('7-4_stock_data.csv')
df

  tickers            eps  revenue price         people  Unnamed: 5
0   GOOGL          27.82       87   845     larry page         NaN
1     WMT           4.61      484    65           n.a.         NaN
2    MSFT             -1       85    64     bill gates         NaN
3     RIL  not available       50  1023  mukesh ambani         NaN
4    TATA            5.6       -1  n.a.     ratan tata         NaN

### View only a certain number of rows in dataframe by using argument nrows

In [2]:
df = pd.read_csv('7-4_stock_data.csv', nrows=3)
df

  tickers    eps  revenue  price      people  Unnamed: 5
0   GOOGL  27.82       87    845  larry page         NaN
1     WMT   4.61      484     65        n.a.         NaN
2    MSFT  -1.00       85     64  bill gates         NaN

### Clean up n.a. and "not available" by changing them to NaN (Not a Number value)

In [3]:
df = pd.read_csv('7-4_stock_data.csv', na_values=["not available", "n.a."])
df

  tickers    eps  revenue   price         people  Unnamed: 5
0   GOOGL  27.82       87   845.0     larry page         NaN
1     WMT   4.61      484    65.0            NaN         NaN
2    MSFT  -1.00       85    64.0     bill gates         NaN
3     RIL    NaN       50  1023.0  mukesh ambani         NaN
4    TATA   5.60       -1     NaN     ratan tata         NaN

### Convert -1 in "revenue" column to NaN (revenue cannot be negative)

In [4]:
df = pd.read_csv('7-4_stock_data.csv', na_values={
    'eps': ['not available', "n.a."],
    'revenue': ["not available", "n.a.", -1],
    'people': ["not available", 'n.a.']
    })
df

  tickers    eps  revenue price         people  Unnamed: 5
0   GOOGL  27.82     87.0   845     larry page         NaN
1     WMT   4.61    484.0    65            NaN         NaN
2    MSFT  -1.00     85.0    64     bill gates         NaN
3     RIL    NaN     50.0  1023  mukesh ambani         NaN
4    TATA   5.60      NaN  n.a.     ratan tata         NaN

## Writing back to CSV

In [5]:
df.to_csv('new.csv', index=False)

In [6]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people', 'Unnamed: 5'], dtype='object')

In [7]:
df.to_csv("new.csv", columns=['tickers', 'eps'])

In [8]:
df.to_csv("new.csv", header=False)

### Reading an Excel file into a pandas dataframe

In [9]:
df = pd.read_excel("7-4_stock_data.xlsx", "Sheet1")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

### Use converter to change "n.a." under people in Walmart row

In [12]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'sam walton'
    return cell

df = pd.read_excel("7-4_stock_data.xlsx", "Sheet1", converters = {
    'people': convert_people_cell,})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sam walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [18]:
def convert_eps_cell(cell):
    if cell=="not available":
        return None
    return cell

def convert_people_cell(cell):
    if cell=="n.a.":
        return 'sam walton'
    return cell

df = pd.read_excel("7-4_stock_data.xlsx", "Sheet1", converters = {
    'eps': convert_eps_cell,
    'people': convert_people_cell})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

### Writing to an Excel file

In [21]:
df.to_excel("new.xlsx", sheet_name="stocks") # There is a bug in jupyter notebook that doesn't allow Excel files
                                             # written from dataframes to open in jupyter

In [22]:
df = pd.read_excel("new.xlsx", sheet_name="stocks")
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

In [25]:
df.to_excel("new.xlsx", sheet_name="stocks", index=False) #Skip the index column

In [29]:
df.to_excel("new.xlsx", sheet_name="stocks", startrow=1, startcol=2) #Offset location in Excel spreadsheet

### Writing two dataframes to the same Excel file

In [30]:
# First create two dataframes

df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather = pd.DataFrame({
    'day': ["1/1/2017", "1/2/2017", "1/3/2017"],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sun', 'Snow']
})

In [32]:
with pd.ExcelWriter("stocks_weather.xlsx") as writer:
    df_stocks.to_excel(writer, sheet_name="Stocks")
    df_weather.to_excel(writer, sheet_name="Weather")

In [33]:
df = pd.read_excel("stocks_weather.xlsx")
df

  tickers  price     pe    eps
0   GOOGL    845  30.37  27.82
1     WMT     65  14.26   4.61
2    MSFT     64  30.97   2.12

In [35]:
df = pd.read_excel("stocks_weather.xlsx", sheet_name="Weather")
df

        day  temperature event
0  1/1/2017           32  Rain
1  1/2/2017           35   Sun
2  1/3/2017           28  Snow